app/Controllers/Superadmin.php

    public function login()
    {
        if ($_POST) {
            $validation = $this->validate([
                'username' => 'required|regex_match[/^[a-zA-Z0-9\s]+$/]',
                'password' => 'required|min_length[5]|max_length[15]',
            ]);
            if (!$validation) {
                $validation = \Config\Services::validation();
                $errors = $validation->getErrors();
                $message = ['status' => 'errors', 'data' => 'Validate form', 'errors' => $errors];
                return $this->response->setJSON($message);
            } else {
                $un = trim($this->request->getPost('username'));
                $ps = trim($this->request->getPost('password'));

                $adminModel = new \App\Models\SuperadminModel();

                $userData = $adminModel->where('username', esc($un))->first();
---
SELECT *
FROM `superadmin`
WHERE `username` = 'superadmin'
 LIMIT 1

    public function servicedata()
    {
        try {
            $draw = $_GET['draw'] ?? 1;
            $start = $_GET['start'] ?? 0;
            $length = $_GET['length'] ?? 10;
            $searchValue = $_GET['search']['value'] ?? '';
            $orderColumnIndex = $_GET['order'][0]['column'] ?? 0;
            $orderColumnName = $_GET['columns'][$orderColumnIndex]['data'] ?? 'id';
            $orderDir = $_GET['order'][0]['dir'] ?? 'asc';

            $dt = $this->gM->getResp('service');

            if (!empty($searchValue)) {
                $dt->groupStart()
                    ->orLike('service', $searchValue)
                    ->groupEnd();
            }

            $dt->orderBy($orderColumnName, $orderDir);

            $data = $dt->get($length, $start)->getResultArray();
---
SELECT *
FROM `service`
ORDER BY 1 DESC
 LIMIT 10