app/Models/GeneralModel.php

    function getNotificationData($table)
    {
        $query = $this->db->table($table)
            ->select('notification.*, raised_tickets.*')
            ->join('raised_tickets', 'raised_tickets.id = notification.ticket_id', 'left')
            ->where('is_notified', '0')
            ->get();
---
SELECT `notification`.*, `raised_tickets`.*
FROM `notification`
LEFT JOIN `raised_tickets` ON `raised_tickets`.`id` = `notification`.`ticket_id`
WHERE `is_notified` = '0'